+
-
ability
able
above
absolutely
access
according
account
accurate
across
activate
active
actually
add
added
adding
admit
advertised
advise
aesthetically
ag
again
ago
agree
ahead
aim
almost
alone
along
alot
already
although
always
amazing
amazon
amoled
among
amount
andk
android
animations
annoying
another
answers
anybody
anymore
anyone
anything
app
apparent
apple
applications
applied
apps
area
around
arrived
art
ask
aspect
atleast
audio
authentication
auto
autofocus
automatically
available
average
away
awesome
back-up
background
backup
bad
based
basic
battery
bcoz
beast
beautiful
become
been
before
began
being
believe
best
better
bettry
between
bezel
bezels
big
bigger
biggest
bit
black
blackberry
blaster
bloatware
blows
bluetooth
body
both
bottom
bought
box
brand
bright
brighter
brightness
brilliant
broke
broken
browsing
btw
bug
buggy
build
built
business
button
buttons
buy
buying
call
calling
calls
came
camera
cameras
cannot
canot
cant
capable
car
card
care
carriers
case
cause
cell
cellphone
cent
center
certain
change
changed
charge
charged
charger
charges
charging
cheap
check
checked
checking
choice
chose
clarity
clean
clear
close
closed
cloudyg3
code
color
colors
combat
comes
comfortable
coming
common
companies
company
comparatively
compare
compared
comparing
complain
complained
complaint
complaints
completely
computer
concern
condition
conditions
connect
connected
connecting
connection
connections
consider
consideration
considering
consume
consumes
consumption
contact
continues
contract
contrast
cool
correct
cost
couldnot
country
couple
course
cover
covered
covers
crack
cracked
cracks
crap
crazy
crisp
current
custom
customer
customizable
customization
cutting
cuz
d
d850
d855
d855gb
daily
damage
damaged
dark
data
days
dead
deal
death
decent
decide
decided
defect
defective
definitely
degree
delicate
demo
depending
design
despite
detail
developed
device
devices
did
didnot
didnt
die
died
difference
different
difficult
dim
dis
disabled
disappointed
disappointing
disappointment
display
distortion
does
doesnt
doing
don't
done
donot
dont
dosnt
double
down
download
downloading
downside
drain
drainage
drained
draining
drains
drive
droid
drop
dropped
dropping
dual
dude
due
durability
durable
during
each
ear
ease
easier
easily
easy
ebay
ecellular
edge
either
else
email
encounter
end
ended
ends
english
enjoy
enough
entire
especially
etc
ever
every
everyday
everyone
everything
exactly
examined
excellent
except
excited
expandable
expect
expected
expensive
experience
experienced
experiencing
explain
exterior
external
extra
extremely
eye
eyes
fabulous
face
facebook
facing
fact
factory
fade
fall
fan
fantastic
far
fast
faster
fault
faults
faulty
favorite
feature
features
feel
feeling
feels
fell
few
file
files
finally
find
fine
fit
fits
five
fix
fixed
flagship
flash
flat
flaw
flawless
flip
focus
focusing
fone
force
forever
formah
found
four
free
freezes
friend
front
frustrating
full
fully
fun
function
functions
future
g
g2
g3
g3gb
g3is
g4
g6
galaxy
game
games
gaming
garbage
gave
gb
general
gets
getting
gimmick
given
gives
giving
glass
glitches
goes
going
gold
gone
good
google
gorgeous
got
gps
graphics
great
guess
guys
guyz
had
half
hand
handle
hands
handset
hang
hanging
happen
happened
happening
happier
happy
hard
hard-pressed
hardly
hardware
has
hasnot
hate
hav
havenot
having
hd
headphone
hear
heard
hearing
heat
heated
heating
heats
heavy
held
hell
hello
help
hence
here
hey
hi
hidden
high
higher
highest
highly
hit
hitting
hog
hold
home
honestly
hope
hoped
hoping
horrible
hot
hotspot
hour
hours
however
hrs
htc
huge
human
hunt
i
iam
icon
icons
idea
idle
ihave
im
image
immediately
impossible
impressed
impressive
improvement
inbuilt
inch
including
income
increase
incredible
innovative
installed
instance
instead
instructions
insurance
interest
interface
internal
internet
intuitive
iphone
iphones
ir
isnot
isnt
issue
issues
items
itis
itself
ive
iwill
iwould
jack
june
junk
k
kat
keep
keeping
keeps
kept
keyboard
keys
kind
kit
kitkat
knew
knock
know
known
korea
l
lag
lagging
laggy
lags
large
larger
laser
last
lasted
lasthrs
lasts
later
latest
lcd
learned
learning
least
left
lens
less
let
lets
level
lexus
lg
lg3
lgg3
lgis
life
light
like
liked
likely
line
list
listen
listening
literally
little
live
loading
locked
locking
lolipop
lollipop
long
longer
looked
looking
looks
lose
loss
lot
lots
loud
louder
love
loved
loves
loving
low
lower
lowered
lte
m
m7
m8
made
mail
main
major
make
makes
making
man
management
manual
manufacturer
many
mark
market
matter
max
may
maybe
mean
means
media
medium
memory
mention
mentioned
mentioning
message
messages
messed
mic
micro
microphone
middle
might
mind
mine
minimum
minute
minutes
miss
missed
mistake
mobile
mode
model
moderate
money
month
months
more
mostly
moto
move
movies
mpixel
much
multi
multiple
multitasking
music
must
myself
n
near
nearly
necessary
need
needed
needs
negative
net
network
networking
never
new
next
nexus
nice
night
no
nokia
none
normal
normally
not
notch
note
note4
nothing
notice
noticed
notifications
nov
occasional
odd
off
offered
offers
often
oh
ok
okay
okey
old
older
once
ones
online
onscreen
open
opened
opening
operating
opinion
optimized
option
options
order
ordered
os
others
outside
overall
overheat
overheating
overheats
overnight
overpriced
own
owned
owning
p
package
packaged
paid
panel
par
part
past
pattern
pay
paying
pc
people
per
perfect
perfectly
performance
person
personal
phablet
phenomenal
phone
phoneis
phones
photo
photos
physical
pic
pick
pics
picture
pictures
piece
pixel
pixels
place
placement
plain
plan
planning
plastic
play
played
playing
pleasant
please
plenty
plug
plus
plz
pocket
point
poor
pop
port
position
positive
possible
power
powerful
ppi
prefer
press
pressing
pretty
previous
previously
price
primarily
pro
probably
problem
problems
processing
processor
product
proof
properly
protector
provide
purchase
purchased
push
pushed
put
puts
qhd
quad
quadhd
quality
quick
quickly
quite
ram
random
randomly
range
rarely
rate
rather
ratio
read
reader
reading
ready
real
realized
really
rear
reason
reasons
reboot
reboots
receive
received
recently
reception
recommend
recommended
reconsider
recording
records
refurbished
refused
regret
released
remote
removable
remove
repair
replace
replaced
replacement
replacing
reported
research
reset
resolution
resolve
respond
responsive
restart
restarting
restored
results
return
returned
returning
review
reviews
rich
ridiculous
right
rom
root
rooted
routines
run
running
runs
s3
s4
s5
safe
said
same
samsung
satisfactory
satisfied
saturated
save
saver
saw
saying
says
scanner
screen
screens
sd
second
seconds
security
seem
seemed
seems
seen
seller
selling
send
sending
sense
sensor
sent
serious
service
services
set
setting
settings
setup
several
shame
share
sharp
shattered
shipping
shit
shocked
shoot
short
shortcuts
shots
should
shouldnot
show
shut
shutdown
shuts
shutting
side
silly
sim
similar
simple
simply
since
single
six
size
skin
sleek
sleep
slick
slightly
slim
slippery
slow
slowly
sluggish
small
smaller
smart
smartphone
smooth
sms
snapdragon
snappy
social
soft
softer
software
sold
solid
solution
solve
something
sometimes
sony
soo
soon
sot
sound
sounds
space
spare
speaker
speakerphone
speakers
speaking
specially
specification
specs
spectacular
speed
spot
sprint
stable
stamp
stanby
stand
standard
standard:
standby
star
stars
start
started
starting
starts
stay
step
still
stock
stop
stopped
storage
store
stores
straight
streaming
strong
stuck
stuff
stunning
stupid
stylus
subsequently
such
sucks
suggest
suite
super
superb
support
supposed
sure
surfing
surprise
surprised
swift
switched
switching
system
t
t-mobile
take
taken
takes
taking
talking
tap
task
tell
tempered
tend
terms
terrible
terrific
test
tested
text
texting
thank
thanks
thatis
thats
thebest'
thek
thereis
thin
thing
things
thinking
those
though
thought
three
through
thru
thumbs
tightly
til
till
time
times
today
told
too
took
top
total
touch
touchscreen
tracfone
transfer
treat
tried
trouble
true
try
trying
turbo
turn
turned
turning
turns
tv
twice
twitter
tym
type
typing
u
ui
um
unable
under
understand
unit
unless
unlike
unlock
unlocked
unstable
unsuccessful
until
update
updated
updates
updating
upgrade
upgraded
upto
ur
usage
usb
used
useful
useless
user
users
uses
using
usually
value
vendor
verizon
version
versions
very
via
vibrant
video
videos
viewing
voice
voicemail
volume
vr
w
wait
waiting
wake
wall
wallpapers
wanted
wanting
wants
warehouse
warm
warranty
washed
wasnot
waste
watching
water
watsapp
web
week
weeks
went
were
whatsapp
whenever
where
whether
while
white
whole
why
wi-fi
wife
wifi
window
winner
wipe
wireless
wise
wish
withg
withgb
within
without
won
wonder
wonderful
wondering
wont
words
worked
working
works
world
worried
worse
worst
worth
wouldnot
wow
wrong
x
years
yes
yesterday
yet
youare
youtube
youwill
z3
zero
